thesourcerer8/Flying-PCB/Software/LARIX_Software_150907/Dave/Generated/src/USBD_LLD/driver/xmc4_usb.h
/*******************************************************************************
 Copyright (c) 2014, Infineon Technologies AG                                 **
 All rights reserved.                                                         **
                                                                              **
 Redistribution and use in source and binary forms, with or without           **
 modification,are permitted provided that the following conditions are met:   **
                                                                              **
 *Redistributions of source code must retain the above copyright notice,      **
 this list of conditions and the following disclaimer.                        **
 *Redistributions in binary form must reproduce the above copyright notice,   **
 this list of conditions and the following disclaimer in the documentation    **
 and/or other materials provided with the distribution.                       **
 *Neither the name of the copyright holders nor the names of its contributors **
 may be used to endorse or promote products derived from this software without**
 specific prior written permission.                                           **
                                                                              **
 THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"  **
 AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE    **
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   **
 ARE  DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE   **
 LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR         **
 CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF         **
 SUBSTITUTE GOODS OR  SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS    **
 INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN      **
 CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)       **
 ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE   **
 POSSIBILITY OF SUCH DAMAGE.                                                  **
                                                                              **
 To improve the quality of the software, users are encouraged to share        **
 modifications, enhancements or bug fixes with Infineon Technologies AG       **
 dave@infineon.com).                                                          **
                                                                              **
********************************************************************************
**                                                                            **
**                                                                            **
** PLATFORM : Infineon XMC4000 Series                                         **
**                                                                            **
** COMPILER : Compiler Independent                                            **
**                                                                            **
** AUTHOR : App Developer                                                     **
**                                                                            **
** MAY BE CHANGED BY USER [yes/no]: No                                        **
**                                                                            **
** MODIFICATION DATE : Feb 21, 2014     		                              **
**                                                                            **
*******************************************************************************/
/**
 * @file xmc4_usb.h
 * @version $Id$
 *
 * @brief USB driver
 *
 * USB Device Driver Header-File.
 *
 * History
 *
 * Version 1.0.0
 *   Initial
 *
 */

#ifndef XMC4_USB_H
#define XMC4_USB_H

#ifdef __cplusplus
extern "C" {
#endif

#include <stdlib.h>
#include <string.h>
#include <uc_id.h>

#if (__TARGET_DEVICE__ == XMC45)
#include <XMC4500.h>
#elif (__TARGET_DEVICE__ == XMC44)
#include <XMC4400.h>
#elif ((__TARGET_DEVICE__ == XMC42) ||(__TARGET_DEVICE__ == XMC41) )
#include <XMC4200.h>
#else
#error "Unsupported XMC family"
#endif
#include "xmc4_common.h"

/** Register Definitions */
/** Maximum endpoint channel */
#define MAX_EPS_CHANNELS  ( 7U )
/** Maximum periodic fifos in usb core */
#define MAX_PERIO_FIFOS   ( 1U )
/** Maximum tx fifos */
#define MAX_TX_FIFOS      ( 14U )

/* dwc_dma_t type definition and register header file inclusion */
typedef void* dwc_dma_t;
#include "dwc_otg_regs.h"

/** Maximum packet size for endpoint0 */
#define USB_MAX_PACKET_SIZE_EP0 ( 64U )
/** Register Address */
#define USB_BASE_ADDRESS 		( (uint8_t*)USB0_BASE )

/** Number of hardware tx endpoint fifos */
#define USB_NUM_TX_FIFOS    ( 7U )
/** Overall FIFO size in bytes */
#define USB_MAX_FIFO_SIZE   ( 2048U )
/** Number of hardware endpoints */
#define USB_NUM_EPS         ( 7U )
/** Maximum packet size for all endpoints (including ep0) */
#define	USB_MAX_PACKET_SIZE ( 64U )

/**
 * \brief Maximum transfer size for endpoints.
 *
 * It's based on the maximum payload, due to the fact,
 * that we only can transfer 2^10 - 1 packets and this is less than the
 * transfer size field can hold.
 */
#define USB_MAX_TRANSFER_SIZE  (((1<<10)-1)*USB_MAX_PACKET_SIZE)

/**
 * \brief Maximum transfer size for endpoint 0
 *
 * Due to the hardware the endpoint transfer size is limited to 64 byte.
 */
#define USB_MAX_TRANSFER_SIZE_EP0 ( 64U )

/* ep0 definitions */
/** Amount of setup packets */
#define USB_SETUP_COUNT  ( 3U )
/** Size of setup data */
#define USB_SETUP_SIZE   ( 8U )

/* ep definitions */
/** Endpoint number mask */
#define USB_EP_NUM_MASK  ( 0x0FU )
/** Endpoint direction mask */
#define USB_EP_DIR_MASK  ( 0x80U )

/* Register Flags */
/** FS device speed flag in DCFG register */
#define USB_DCFG_DevSpd_FS	 ( 0x3U )

/* Fifo definitions */
/** First fifo register offset from base address */
#define USB_TX_FIFO_REG_OFFSET  ( 0x1000U )
/** Offset for each fifo register */
#define USB_TX_FIFO_OFFSET		( 0x1000U )

/* USB Endpoint Address (bEndpointAddress) */
#define USB_USB_ENDPOINT_NUMBER_MASK    ( 0x0FU )
#define USB_USB_ENDPOINT_DIRECTION_MASK ( 0x80U )

