thesourcerer8/Flying-PCB/Software/LARIX_Software_150907/Dave/Generated/src/USBD_LLD/driver/xmc4_usb.h
/*  Endpoint Maximum Packet Size (wMaxPacketSize) */
#define USB_ENDPOINT_MAX_PACKET_SIZE_MASK          ( 0x07FFU )
#define USB_ENDPOINT_MICROFRAME_TRANSACTIONS_MASK  ( 0x1800U )
#define USB_ENDPOINT_MICROFRAME_TRANSACTIONS_1     ( 0x0000U )
#define USB_ENDPOINT_MICROFRAME_TRANSACTIONS_2     ( 0x0800U )
#define USB_ENDPOINT_MICROFRAME_TRANSACTIONS_3     ( 0x1000U )

/* Speed Mode. Full Speed */
#define USB_SPEED_FULL (1U)

/** FIFO size for Endpoint 0 in bytes */
#define USB_EP0_TX_FIFO_SIZE 64
/** FIFO size for Endpoint 1 in bytes */
#define USB_EP1_TX_FIFO_SIZE 64
/** FIFO size for Endpoint 2 in bytes */
#define USB_EP2_TX_FIFO_SIZE 64
/** FIFO size for Endpoint 3 in bytes */
#define USB_EP3_TX_FIFO_SIZE 64
/** FIFO size for Endpoint 4 in bytes */
#define USB_EP4_TX_FIFO_SIZE 64
/** FIFO size for Endpoint 5 in bytes */
#define USB_EP5_TX_FIFO_SIZE 64
/** FIFO size for Endpoint 6 in bytes */
#define USB_EP6_TX_FIFO_SIZE 64

/**
 * \name Buffer size
 */
/** Endpoint 0 buffer size */
#define USB_EP0_BUFFER_SIZE 64
/** Endpoint 1 buffer size */
#define USB_EP1_BUFFER_SIZE 64
/** Endpoint 2 buffer size */
#define USB_EP2_BUFFER_SIZE 64
/** Endpoint 3 buffer size */
#define USB_EP3_BUFFER_SIZE 64
/** Endpoint 4 buffer size */
#define USB_EP4_BUFFER_SIZE 256
/** Endpoint 5 buffer size */
#define USB_EP5_BUFFER_SIZE 256
/** Endpoint 6 buffer size */
#define USB_EP6_BUFFER_SIZE 256

#define USB_CHECK_INPUT_MAX_NUM_CONTROL_EPS(usb_max_num_control_eps) \
  ((usb_max_num_control_eps ==  USB_MAX_NUM_CONTROL_EPS_1 ) || \
   (usb_max_num_control_eps ==  USB_MAX_NUM_CONTROL_EPS_2 ) || \
   (usb_max_num_control_eps ==  USB_MAX_NUM_CONTROL_EPS_3 ) || \
   (usb_max_num_control_eps ==  USB_MAX_NUM_CONTROL_EPS_4 ) || \
   (usb_max_num_control_eps ==  USB_MAX_NUM_CONTROL_EPS_5 ) || \
   (usb_max_num_control_eps ==  USB_MAX_NUM_CONTROL_EPS_6 ) || \
   (usb_max_num_control_eps == USB_MAX_NUM_CONTROL_EPS_7 ))

#define USB_CHECK_INPUT_MAX_NUM_OUT_EPS_EPS(usb_max_num_out_eps) \
  ((usb_max_num_out_eps ==  USB_MAX_NUM_OUT_EPS_1  ) || \
   (usb_max_num_out_eps ==  USB_MAX_NUM_OUT_EPS_2 ) || \
   (usb_max_num_out_eps ==  USB_MAX_NUM_OUT_EPS_3 ) || \
   (usb_max_num_out_eps ==  USB_MAX_NUM_OUT_EPS_4 ) || \
   (usb_max_num_out_eps ==  USB_MAX_NUM_OUT_EPS_5 ) || \
   (usb_max_num_out_eps ==  USB_MAX_NUM_OUT_EPS_6 ) || \
   (usb_max_num_out_eps == USB_MAX_NUM_OUT_EPS_7 ))


#define USB_CHECK_INPUT_MAX_NUM_IN_EPS_EPS(usb_max_num_in_eps) \
  ((usb_max_num_in_eps ==  USB_MAX_NUM_IN_EPS_1 ) || \
   (usb_max_num_in_eps ==  USB_MAX_NUM_IN_EPS_2 ) || \
   (usb_max_num_in_eps ==  USB_MAX_NUM_IN_EPS_3 ) || \
   (usb_max_num_in_eps ==  USB_MAX_NUM_IN_EPS_4 ) || \
   (usb_max_num_in_eps ==  USB_MAX_NUM_IN_EPS_5 ) || \
   (usb_max_num_in_eps ==  USB_MAX_NUM_IN_EPS_6 ) || \
   (usb_max_num_in_eps == USB_MAX_NUM_IN_EPS_7 ))

#define USB_CHECK_INPUT_MAX_NUM_EPS_EPS(usb_max_num_eps) \
  ((usb_max_num_eps ==  USB_MAX_NUM_EPS_1 ) || \
   (usb_max_num_eps ==  USB_MAX_NUM_EPS_2 ) || \
   (usb_max_num_eps ==  USB_MAX_NUM_EPS_3 ) || \
   (usb_max_num_eps ==  USB_MAX_NUM_EPS_4 ) || \
   (usb_max_num_eps ==  USB_MAX_NUM_EPS_5 ) || \
   (usb_max_num_eps ==  USB_MAX_NUM_EPS_6 ) || \
   (usb_max_num_eps == USB_MAX_NUM_EPS_7 ))
/**
 * @ingroup USBD_LLD_enumerations
 * @{
 */
/** GRXSTSP Register PktSts options */
typedef enum USB_GRXSTS_PktSts {
  USB_GRXSTS_PktSts_GOutNAK   = 0x1U, /**< Global out nak send ( triggers an interrupt ) */
  USB_GRXSTS_PktSts_OutData   = 0x2U, /**< OUT data packet received */
  USB_GRXSTS_PktSts_OutCmpl   = 0x3U, /**< OUT transfer completed (triggers an interrupt) */
  USB_GRXSTS_PktSts_SetupCmpl = 0x4U, /**< SETUP transaction completed (triggers an interrupt) */
  USB_GRXSTS_PktSts_Setup     = 0x6U /**< SETUP data packet received */
}USB_GRXSTS_PktSts_t;

/**
\brief Enumeration status
*/
typedef enum USB_USBD_ENUM {
USB_USBD_EVENT_ENUM_NOT_DONE, /**< USB Enumeration not Done*/
USB_USBD_EVENT_ENUM_DONE /**< USB Enumeration Done*/
} USB_USBD_ENUM_t;


/** Endpoint type options */
typedef enum USB_EP_TYPE {
  USB_EP_TYPE_Control = 0x0U, /**< Control endpoint */
  USB_EP_TYPE_Iso     = 0x1U, /**< Isochronous endpoint */
  USB_EP_TYPE_Intr    = 0x2U, /**< Interrupt endpint */
  USB_EP_TYPE_Bulk    = 0x3U /**< Bulk endpoint */
}USB_EP_TYPE_t;

/**
\brief  USB Endpoint Type
*/
typedef enum USB_ENDPOINT_TYPE {
  USB_ENDPOINT_CONTROL,
  USB_ENDPOINT_ISOCHRONOUS,
  USB_ENDPOINT_BULK,
  USB_ENDPOINT_INTERRUPT,
} USB_ENDPOINT_TYPE_t;

/**
 * @}
 */


/**
 * @ingroup USBD_LLD_enumerations
 * @{
 */
/**
\brief  USB Device SET_ADDRESS Stage
*/
typedef enum USB_USBD_SET_ADDRESS_STAGE {
  USB_USBD_SET_ADDRESS_SETUP,
  USB_USBD_SET_ADDRESS_STATUS
} USB_USBD_SET_ADDRESS_STAGE_t;


/**
\brief  USB Device Status of executed operation
*/
typedef enum USB_USBD_STATUS {
  USB_USBD_OK       =  0U,               /**< USBD Status: Operation succeeded*/
  USB_USBD_ERROR    =  1U                /**< USBD Status: Unspecified error*/
} USB_USBD_STATUS_t;


/**
\brief  USB Device Event
*/
typedef enum USB_USBD_EVENT {
  USB_USBD_EVENT_POWER_ON,              /**< USB Device Power On*/
  USB_USBD_EVENT_POWER_OFF,             /**< USB Device Power Off*/
  USB_USBD_EVENT_CONNECT,               /**< USB Device connected*/
  USB_USBD_EVENT_DISCONNECT,            /**< USB Device disconnected*/
  USB_USBD_EVENT_RESET,                 /**< USB Reset occurred*/
  USB_USBD_EVENT_HIGH_SPEED,            /**< USB switch to High Speed occurred*/
  USB_USBD_EVENT_SUSPEND,               /**< USB Suspend occurred*/
  USB_USBD_EVENT_RESUME,                /**< USB Resume occurred*/
  USB_USBD_EVENT_REMOTE_WAKEUP,       	/**< USB Remote wakeup*/
  USB_USBD_EVENT_SOF 					/**< USB Start of frame event */ /*IFX*/
} USB_USBD_EVENT_t;

/**
\brief  USB Endpoint Event
*/
typedef enum USB_USBD_EP_EVENT {
  USB_USBD_EP_EVENT_SETUP,              /**< SETUP Packet*/
  USB_USBD_EP_EVENT_OUT,                /**< OUT Packet*/
  USB_USBD_EP_EVENT_IN                  /**< IN Packet*/
} USB_USBD_EP_EVENT_t;

/**
\brief  Transfer Mode
*/
typedef enum USB_TRANSFER_MODE {
  USB_USE_DMA,  /**< transfer by DMA*/
  USB_USE_FIFO,  /**< transfer by FIFO*/
} USB_TRANSFER_MODE_t;

/**
 * @}
 */

/**
\brief Number of Endpoints used
*/
typedef enum USB_MAX_NUM_EPS {
  USB_MAX_NUM_EPS_1 = 1U,
  USB_MAX_NUM_EPS_2 = 2U,
  USB_MAX_NUM_EPS_3 = 3U,
  USB_MAX_NUM_EPS_4 = 4U,
  USB_MAX_NUM_EPS_5 = 5U,
  USB_MAX_NUM_EPS_6 = 6U,
  USB_MAX_NUM_EPS_7 = 7U,
} USB_MAX_NUM_EPS_t;

/**
\brief Number of Control Endpoints
*/
typedef enum USB_MAX_NUM_CONTROL_EPS {
  USB_MAX_NUM_CONTROL_EPS_1 = 1U,
  USB_MAX_NUM_CONTROL_EPS_2 = 2U,
  USB_MAX_NUM_CONTROL_EPS_3 = 3U,
  USB_MAX_NUM_CONTROL_EPS_4 = 4U,
  USB_MAX_NUM_CONTROL_EPS_5 = 5U,
  USB_MAX_NUM_CONTROL_EPS_6 = 6U,
  USB_MAX_NUM_CONTROL_EPS_7 = 7U,
} USB_MAX_NUM_CONTROL_EPS_t;

/**
\brief Number of Output Endpoints
*/
typedef enum USB_MAX_NUM_OUT_EPS {
  USB_MAX_NUM_OUT_EPS_1 = 1U,
  USB_MAX_NUM_OUT_EPS_2 = 2U,
  USB_MAX_NUM_OUT_EPS_3 = 3U,
  USB_MAX_NUM_OUT_EPS_4 = 4U,
  USB_MAX_NUM_OUT_EPS_5 = 5U,
  USB_MAX_NUM_OUT_EPS_6 = 6U,
  USB_MAX_NUM_OUT_EPS_7 = 7U,
} USB_MAX_NUM_OUT_EPS_t;

/**
\brief Number of Input Endpoints
*/
typedef enum USB_MAX_NUM_IN_EPS {
  USB_MAX_NUM_IN_EPS_1 = 1U,
  USB_MAX_NUM_IN_EPS_2 = 2U,
  USB_MAX_NUM_IN_EPS_3 = 3U,
  USB_MAX_NUM_IN_EPS_4 = 4U,
  USB_MAX_NUM_IN_EPS_5 = 5U,
  USB_MAX_NUM_IN_EPS_6 = 6U,
  USB_MAX_NUM_IN_EPS_7 = 7U,
} USB_MAX_NUM_IN_EPS_t;



/**
 * @ingroup USBD_LLD_datastructures
 * @{
 */

/**
\brief  USB Device State
*/
typedef struct USB_USBD_STATE {
  uint8_t powered     : 1;              /**< USB Device powered flag*/
  uint8_t connected   : 1;              /**< USB Device connected flag*/
  uint8_t active      : 1;              /**< USB Device active lag*/
  uint8_t speed       : 2;              /**< USB Device speed setting*/
} USB_USBD_STATE_t;

/**
\brief  USB Device Driver Capabilities.
*/
typedef struct USB_USBD_CAPABILITIES {
  uint32_t event_power_on      :  1;    /**< Signal Power On event*/
  uint32_t event_power_off     :  1;    /**< Signal Power Off event*/
  uint32_t event_connect       :  1;    /**< Signal Connect event*/
  uint32_t event_disconnect    :  1;    /**< Signal Disconnect event*/
  uint32_t event_reset         :  1;    /**< Signal Reset event*/
  uint32_t event_high_speed    :  1;    /**< Signal switch to High-speed event*/
  uint32_t event_suspend       :  1;    /**< Signal Suspend event*/
  uint32_t event_resume        :  1;    /**< Signal Resume event*/
  uint32_t event_remote_wakeup :  1;    /**< Signal Remote Wakeup event*/
  uint32_t reserved            : 23;    /**< reserved for future use*/
} USB_USBD_CAPABILITIES_t;

/**
 * @}
 */




/**
\brief Device Events pointer
*/
/**< Pointer to \ref USB_USBD_SignalDeviceEvent_t : Signal USB Device Event.*/
typedef void (*USB_USBD_SignalDeviceEvent_t)   (USB_USBD_EVENT_t event);

/**
\brief End point Events pointer
*/
/**< Pointer to \ref USB_USBD_SignalEndpointEvent_T : Signal USB Endpoint Event.*/
typedef void (*USB_USBD_SignalEndpointEvent_t) (uint8_t ep_addr, USB_USBD_EP_EVENT_t ep_event);

/**
 * @ingroup USBD_LLD_datastructures
 * @{
 */

/**
 * \brief A struct describing an endpoint
 *
 * All information to control an endpoint is stored in this struct.
 * It contains informatio about the endpoints and the status of the device.
 */
 #ifdef __CC_ARM
 #pragma anon_unions
 #endif
typedef struct xmc_usb_ep{
  /** \name Configuration */
  union {
    uint32_t address:8; /**< the endpoint address including the direction */
      struct {
        uint32_t number:4; /**< the endpoint number */
        uint32_t :3; /**< Pading between number and direction */
        uint32_t direction:1; /**< the endpoint direction */
	  };
    };
  uint32_t type:2; /**< the endpoint type */
  uint32_t isConfigured:1; /**< a flag showing, if the endpoint is configured */
  volatile uint32_t inInUse:1; /**< a flag showing, if the endpoint in in direction is currently in use */
  volatile uint32_t outInUse:1; /**< a flag showing, if the endpoint in out direction is currently in use */
  uint32_t isStalled:1; /**< a flag showing, if the endpoint is stalled. */
  uint32_t txFifoNum:4; /**< TX Fifo Number */
  uint32_t sendZeroLengthPacket:1; /**< a flag showing, if a zero length packet has to be send at the end of the
  	  	  	  	  	  	  	  	  	  transfer */
  uint32_t maxPacketSize:7; /**< the maximum size of packages for this endpoint ( due to FS Speed device only
  	  	  	  	  	  	  	  64 Byte )*/
  uint32_t maxTransferSize:19; /**< the maximum amount of data the core can send at once. (Depends on the field width
  	  	  	  	  	  	  	  	  in the register) */
  /** \name Endpoint buffers */
  uint8_t *outBuffer; /**< the buffer for operation as out endpoint */
  uint32_t outBytesAvailable; /**< bytes available in the out buffer */
  uint32_t outBufferSize; /**< the size of the out buffer */
  uint32_t outOffset; /**< the read offset of the out buffer */
  uint8_t *inBuffer; /**< the buffer for operation as in endpoint */
  uint32_t inBufferSize; /**< the size of the in buffer */
  /* \name Transfer controls */
  uint8_t *xferBuffer; /**< the buffer of the current transfer */
  uint32_t xferLength; /**< the length of the current transfer */
  uint32_t xferCount; /**< bytes transfered of the current transfer */
  uint32_t xferTotal; /**< the length of all data in buffer */
} xmc_usb_ep_t;

/**
 * struct describing a XMC usb device
 *
 * All information to control an xmc usb device is stored in
 * this struct. It contains register, callbacks and information
 * about the endpoints and the status of the device.
 */
typedef struct USB_DEVICE {
  /** \name Endpoints */
  xmc_usb_ep_t ep[8]; /**< Array of endpoints of the device \ref xmc_usb_ep_t */
  /** \name Registers */
  dwc_otg_core_global_regs_t *global_register; /**< Global register interface */
  dwc_otg_device_global_regs_t *device_register; /**< Device register interface */
  dwc_otg_dev_in_ep_regs_t *endpoint_in_register[USB_NUM_EPS]; /**< IN Endpoint register interface */
  dwc_otg_dev_out_ep_regs_t *endpoint_out_register[USB_NUM_EPS]; /**< OUT Endpoint register interface */
  volatile uint32_t *fifo[USB_NUM_TX_FIFOS]; /**< TX Fifo interface */
  /** \name Configuration */
  uint16_t txfifomsk; /**< Mask of used tx fifos */
  /** \name Device Status */
  uint8_t IsConnected:1; /**< Flag if device is connected */
  uint8_t IsActive:1; /**< Flag if device is currently active ( in transfer ) */
  uint8_t IsPowered; /**< Flag if device is powered by Vbus */
  /** \name Callbacks */
  USB_USBD_SignalDeviceEvent_t DeviceEvent_cb; /**< The device event callback */
  USB_USBD_SignalEndpointEvent_t EndpointEvent_cb; /**< The endpoint event callback */
} USB_DEVICE_t;



/**
\brief Initialization structure
*/
typedef struct USB_INIT{
  USB_MAX_NUM_CONTROL_EPS_t usb_max_num_control_eps; /**< Maximum number of Control Endpoints */
  USB_MAX_NUM_OUT_EPS_t usb_max_num_out_eps; /**< Maximum number of OutPut Endpoints  */
  USB_MAX_NUM_IN_EPS_t usb_max_num_in_eps; /**< Maximum number of InPut Endpoints  */
  USB_MAX_NUM_EPS_t usb_max_num_eps;  /**<  Maximum number of max packet size packets to store in rx fifo */
  uint16_t usb_max_num_packets_in_rx_fifo;/**< Number of Packets in RxFifo */
  USB_TRANSFER_MODE_t usb_transfer_mode;/**< USB transfer mode */
} USB_INIT_t;

/**
\brief  Access structure of the USB Device Driver.
*/
/**< Pointer to \ref USB_USBD_GetVersion : Get driver version.*/
typedef struct USB_DRIVER_USBD {
  /**< Pointer to \ref USB_USBD_GetCapabilities : Get driver capabilities.*/
  USB_USBD_CAPABILITIES_t (*GetCapabilities)    (void);

  /**< Pointer to \ref USB_USBD_Initialize : Initialize USB Device Interface.*/
  USB_USBD_STATUS_t       (*Initialize)         (USB_USBD_SignalDeviceEvent_t   cb_device_event,
                                               USB_USBD_SignalEndpointEvent_t cb_endpoint_event,USB_INIT_t usb_init);

