thesourcerer8/Flying-PCB/Software/LARIX_Software_150907/Dave/Generated/src/USBD_LLD/driver/xmc4_usb.h
  /**< Pointer to \ref USB_USBD_Uninitialize : De-initialize USB Device Interface.*/
  USB_USBD_STATUS_t       (*Uninitialize)       (void);

  /**< Pointer to \ref USB_USBD_DeviceConnect : Connect USB Device.*/
  USB_USBD_STATUS_t       (*DeviceConnect)      (void);

  /**< Pointer to \ref USB_USBD_DeviceDisconnect : Disconnect USB Device.*/
  USB_USBD_STATUS_t       (*DeviceDisconnect)   (void);

  /**< Pointer to \ref USB_USBD_DeviceGetState : Get current USB Device State.*/
  USB_USBD_STATE_t        (*DeviceGetState)     (void);

  /**< Pointer to \ref USB_USBD_DeviceSetAddress : Set USB Device Address.*/
  USB_USBD_STATUS_t       (*DeviceSetAddress)   (uint8_t dev_addr, USB_USBD_SET_ADDRESS_STAGE_t stage);

  /**< Pointer to \ref USB_USBD_EndpointConfigure : Configure USB Endpoint.*/
  USB_USBD_STATUS_t       (*EndpointConfigure)  (uint8_t ep_addr, USB_ENDPOINT_TYPE_t ep_type,
                                               uint16_t ep_max_packet_size, USB_INIT_t init);

  /**< Pointer to \ref USB_USBD_EndpointUnconfigure : Unconfigure USB Endpoint.*/
  USB_USBD_STATUS_t       (*EndpointUnconfigure)(uint8_t ep_addr);

  /**< Pointer to \ref USB_USBD_EndpointStall : Set/Clear Stall for USB Endpoint.*/
  USB_USBD_STATUS_t       (*EndpointStall)      (uint8_t ep_addr, bool stall);

  /**< Pointer to \ref USB_USBD_EndpointReadStart : Start USB Endpoint Read operation.*/
  USB_USBD_STATUS_t       (*EndpointReadStart)  (uint8_t ep_addr,       uint8_t *buf, uint32_t len);

  /**< Pointer to \ref USB_USBD_EndpointRead : Read data from USB Endpoint.*/
  int32_t                 (*EndpointRead)       (uint8_t ep_addr,       uint8_t *buf, uint32_t len);

  /**< Pointer to \ref USB_USBD_EndpointWrite : Write data to USB Endpoint.*/
  int32_t                 (*EndpointWrite)      (uint8_t ep_addr, const uint8_t *buf, uint32_t len);

  /**< Pointer to \ref USB_USBD_EndpointAbort : Abort current USB Endpoint transfer.*/
  USB_USBD_STATUS_t       (*EndpointAbort)      (uint8_t ep_addr);

  /**< Pointer to \ref USB_USBD_GetFrameNumber : Get current USB Frame Number.*/
  uint16_t                (*GetFrameNumber)     (void);

  /**< Pointer to \ref USB_IsEnumDone : Is enumeration done in Host?.*/
  USB_USBD_ENUM_t    	  (*IsEnumDone)         (void);

} const USB_DRIVER_USBD_t;

/**
 * @}
 */


/**
 * \brief Driver interface function table
 *
 * To access the XMC device controller driver interface use this table of functions.
*/
extern const USB_DRIVER_USBD_t Driver_USBD0;

/** \brief XMC device data
 *
 * The instance of structure describing the xmc device.
 *
 * \see xmc_usb_device_t
*/
extern USB_DEVICE_t xmc_device;


/** \brief TX fifo size
 *
 * The size of the TX FIFO
 *
 * \see xmc_usb_device_t
*/
extern const uint16_t USB_TX_FIFO_SIZE[USB_NUM_TX_FIFOS];

/** \brief XMC device data
 *
 *  Out Buffer size for each endpoint.
 *
 */
extern  uint32_t USB_USBD_EP_OUT_BUFFERSIZE[USB_NUM_EPS];


/** \brief XMC device data
 *
 *  In Buffer size for each endpoint.
 *
 */
extern uint32_t USB_USBD_EP_IN_BUFFERSIZE[USB_NUM_EPS];


/*
 * Public Functions
 */

/**
 * @ingroup USBD_LLD_apidoc
 * @{
 */

/**
 *
 * \brief Interface to communicate with the device controller (USB MAC)
 *
 * The complete functionality of the  driver is abstracted to set of functions in this module. The functions do no
 * protocol handling. This has to be done in upper layers.
 *
 */

/**
 * \brief Get the capabilities of the driver
 *
 * \return Driver capabilities
 * \see USBD_CAPABILITIES
 */
USB_USBD_CAPABILITIES_t USB_GetCapabilities(void);

/**
 * \brief initialize the device to get ready to connect
 *
 * \param[in] cb_xmc_device_event Device event callback function pointer
 * \param[in] cb_endpoint_event Endpoint event callback function pointer
 *
 * \return Status of the function (See \ref USB_USBD_STATUS_t).
 */
USB_USBD_STATUS_t USB_Init(USB_USBD_SignalDeviceEvent_t cb_xmc_device_event,
		USB_USBD_SignalEndpointEvent_t cb_endpoint_event, USB_INIT_t usb_init);

/**
 * \brief unitialize the device
 *
 * This function frees all used memory, assert the usb reset again and activates the clock-gating again.
 *
 * \return Status of the function (See \ref USB_USBD_STATUS_t)
 */
USB_USBD_STATUS_t USB_Uninitialize(void);


/**
 * \brief Connect device to bus
 *
 * The function just clears the soft disconnect bit, which activates the speed pull up at d+ line.
 *
 * \return Status of the function (See \ref USB_USBD_STATUS_t)
 */
USB_USBD_STATUS_t USB_DeviceConnect(void);


/**
 * \brief Disconnect device from bus
 *
 * The function just sets the soft disconnect bit, which deactivates the speed pull up at d+ line.
 *
 * \return Status of the function (See \ref USB_USBD_STATUS_t)
 */
USB_USBD_STATUS_t USB_DeviceDisconnect(void);

/**
 * \brief Get the state of the device
 *
 * Power, activity and device state data will be collected and return.
 *
 * \return Device state (See \ref USBD_STATE)
 */
USB_USBD_STATE_t USB_DeviceGetState(void);

/**
 * \brief Set the device Address
 *
 * After a successful device request the device address have to be set. The second parameter has no impact.
 *
 * \param[in] address Device address
 * \param[in] stage Device request stage
 * \return Status of the function (See \ref USB_USBD_STATUS_t)
 */
USB_USBD_STATUS_t USB_DeviceSetAddress(uint8_t address,USB_USBD_SET_ADDRESS_STAGE_t stage);

/**
 * \brief Configure an endpoint for use
 *
 * To configure an endpoint two parameters have to be set, based on the configuration presented to the host.
 * At first the endpoint type hast to be set and then the maximum packet size of that endpoint. This function
 * also initialize the internal buffer handling for the specified endpoint, but does not start any transfers.
 *
 * \param[in] ep_addr Endpoint address
 * \param[in] ep_type Endpoint type
 * \param[in] ep_max_packet_size Endpoint maximum packet size
 *
 * \return Status of the function (See \ref USB_USBD_STATUS_t)
 */
USB_USBD_STATUS_t USB_EndpointConfigure(uint8_t ep_addr,USB_ENDPOINT_TYPE_t ep_type, uint16_t ep_max_packet_size,
																							USB_INIT_t usb_init);

/**
 * \brief Unconfigure endpoint
 *
 * This functions waits until the endpoint has finished operation and disables it. All (eventuallly)
 * allocated buffers will be freed.
 *
 * \return Status of the function (See \ref USB_USBD_STATUS_t)
 */
USB_USBD_STATUS_t USB_EndpointUnconfigure(uint8_t ep_addr);

/**
 * \brief Set the endpoint stall condition
 *
 * Depending on the stall flag the endpoint will respond with stall pids or based on the fifo status.
 *
 * \param[in] ep_addr Endpoint
 * \param[in] stall Stall flag
 *
 * \return Status of the function (See \ref USB_USBD_STATUS_t)
 */
USB_USBD_STATUS_t USB_EndpointStall(uint8_t ep_addr, bool stall);

/**
 * \brief Prepare an endpoint to receive out tokens
 *
 * The selected endpoint gets configured, so that it receives the specified amount of data from the host.
 *
 * \param[in] ep_addr Endpoint address
 * \param[in] buffer Buffer address to store data at
 * \param[in] size Size of the buffer
 * \return Status of the function (See \ref USB_USBD_STATUS_t)
 */
USB_USBD_STATUS_t USB_EndpointReadStart(uint8_t ep_addr,uint8_t * buffer,uint32_t size);

/**
 * \brief Read data from an endpoint
 *
 * If data has been received for this endpoint, it gets copied into the user buffer until its full
 * or no data is left in the driver buffer.
 *
 * \param[in] ep_addr Endpoint address
 * \param[in] buffer User buffer
 * \param[in] length Length of data to read
 * \return Amount of data read from the endpoint buffer (>=0) or a negative value if an error happened
 */
int32_t USB_EndpointRead(uint8_t ep_addr,uint8_t * buffer,uint32_t length);

/**
 * \brief Write data to an endpoint
 *
 * The User data gets copied into the driver buffer or will be send directly based on the buffer concept
 * choosen in the configuration. After that the endpoint will be set up to transfer the data to the host.
 *
 * \param[in] ep_addr Endpoint address
 * \param[in] buffer Data buffer to write to the endpoint
 * \param[in] length Length of the data buffer
 *
 * \return Amount of data written to the endpoint buffer (>=0) or a negative value if an error happened
 */
int32_t USB_EndpointWrite(uint8_t ep_addr,const uint8_t * buffer,uint32_t length);

/**
 * \brief Abort the current endpoint operation
 *
 * On any failure with the USB transmission you can reset the endpoint into default state and clear all
 * assigned buffers, to start from a clean point. The endpoint will not be unconfigured or disabled.
 * ( Therefore see \ref USB_UnconfigureEndpoint ) This function forces the endpoint to stop immediately,
 * any pending transfers are killed. ( Can cause device reset. )
 *
 * \param[in] Endpoint address
 * \return Status of the function (See \ref USB_USBD_STATUS_t)
 */
USB_USBD_STATUS_t USB_EndpointAbort(uint8_t ep_addr);

/**
 * \brief Get the current USB frame number
 *
 * \return Frame number
 */
uint16_t USB_GetFrameNumber(void);

/**
 * \brief Is Enumeration Done?
 *
 * \return USB_USBD_ENUM
 */
USB_USBD_ENUM_t USB_IsEnumDone(void);


/**
 * @}
 */


#ifdef __cplusplus
}
#endif

#endif /* XMC4_USB_H */

